[
   {
      "name": "Mini Baked Cheesecakes",
      "Info": "Makes 8",
      "Ingredients": "**Ingredients:**\n -8 Butternut snap biscuits\n-250g cream cheese, soften\n-1/2 cup caster sugar\n-2 eggs, lightly beaten\n-8 cupcake liners\n-Mixed berries, frozen",
      "Method": "**Method:**\n1. Preheat oven to 150C (302F)\n2.Arrange cakecup liners in a muffin tray. Place a biscuit in the bottom of each paper\n3.Beat cream cheese until smooth, gradually add sugar and beat until micture is well combined\n4. Add eggs, half then half, mixing until smooth\n5.Pour mixture into cupcake liners and place a few berries in each\n6.Bake for 25 minutes or until the filling is just set, do not allow mixture to brown or alter in colour\n7.Place tray on a cooling rack and allow to cool for a few minutes before carefully lifting each cheese cake onto the rack to cool. Refrigerate and then enjoy!",
      "Tags": ["dessert", "sweet", "fruit", "cheesecake", "level1", "cheesecakes"]
    },
    {
      "name": "Rocket, Bacon and Potato Frittata",
      "Info": "A spanish dish that is similar to a quiche",
      "Ingredients":"**Ingredients:**\n-1 medium potato\n-1 bacon rasher, chopped coarsely\n-1/2 brown onion, finely diced\n-1 garlic clove, crushed\n-1/2 cup baby rocket leaves, chopped coarsely\n-2 eggs, whisked lightly\n-1/2 cup sour cream (or double amount of eggs)",
      "Method": "**Method:**\n1. Preheat oven to 180C (350F)\n2. Boil potatoes until soft. Let it cool down, peel and cut it into slices\n3. Heat a small frying pan to medium. Add the bacon and cook until brown. Add the onion and garlic; cook, stirring until the onion is soft. Remove the pan from the heat; stir in the rocket\n4. Whisk together the eggs and sour cream until smooth\n5. Place the potato slices into a prepared baking dish; then pour the bacon mixture over the base of the prepared baking dish. Pour the combined egg and sour cream carefully over the bacon and potato\n6.Bake in the ovean for approximately 30 minutes or until frittata is set and just cooked through",
      "Tags": ["breakfast", "savoury", "eggs", "level5", "frittata", "quiche", "liz"]
    },
    {
      "name": "Cottage pie",
      "Info": "A personal favourite winter meal!",
      "Ingredients":"**Ingredients for topping:**\n-5g margarine\n-2 tbsp soy milk\n-2 large potatoes, peeled and chopped\n**Ingredients for filling:**\n-1/2 larged onion, chopped\n-1 clove garlic, minced\n- 2 tsp olive oil\n-1/4 cup green lentils\n-1/2 cup vegetable stock\n-2 tablespoons tomato paste\n-1/4 tsp dried thyme\n-1 cup frozen mixed vegetables",
      "Method": "**Methods:**\n1. Preheat oven to 190C (370F)\n2. Place potatoes in cold water and bring to the boil. Boil until potatoes are soft.\n3. While potatoes are cooking, heat oil in a frying pan and add onion, garlic and lentils, saute' until onions are transparent. Add sotck, tomato paste, mixed vegetables and seasonings.\n4. When potatoes are cooked, drain potatoes and mash until smooth, mix in soy milk and margarine and salt and pepper to taste. Set aside\n5. Place mixture into baking dish and spread the potato mixture on top.",
      "Tags": ["vegan", "dinner", "pie", "savoury", "vegetarian", "level3", "winter", "liz"]
    },
    {
      "name": "Pikelets",
      "Info": "Mini pancakes",
      "Ingredients":"**Ingredients:**\n-1 cup self raising flour\n-2 tbsp caster sugar\n-1 egg, lightly beaten\n-2/3 cup milk",
      "Method": "**Method:**\n1. Mix flour and sugar together in a large bowl and make a well in the centre of the mixture\n2. Add milk to the egg and gradually pour into the flour mixture, using a wooden spoon to mix thoroughly. Set aside\n3. Spray fry pan with oil and allow pan to heat. When hot, place a couple of spoonfuls of the mixture in the pan. Bubbles will appear on the surface of the pikelet, turn, and allow to brown on the other side to cook through.\n4. Lift onto a plate to cool, cover pikelets to keep them soft. Serve either plain, with butter, jam or whipped cream!",
      "Tags": ["breakfast", "level1", "pikelets", "pancakes"]
    },
    {
      "name": "Vegetable Moussaka",
      "Info": "Moussaka is similar to lasagna but doesn't use pasta. Serves 8-10",
      "Ingredients":"**Ingredients:**\n-3 large eggplants, cut into 2cm rounds\n-5 medium zucchini, cut lengthways into 1cm slices\n-1 cup olive oil\n-2 large potatoes, peeled and cut into 1cm slices\n-1 cup of breadcrumbs\n-1 cup of vegan chese\n**Ingredients for the tomato sauce:**\n-2 tablespoons olive oil\n-1 large onion, finely chopped\n-2 garlic cloves, finely chopped\n-800g tin diced tomatoes\n-2 tablespoons tomato paste\n-1 tablespoon dried oregano\n-Bechamel sauce (see `!b recipe bechamel` for recipe`)",
      "Method": "**Method:**\n1. Preheat oven to 180C (350F)\n2. To make tomato sauce, heat oil in a saucepan over medium heat and add onions and garlic to cook until soft, stirring well. Add remaining ingredients, seasoning with salt and pepper. Cover, bring to a simmer and cook for 30 mins, stirring occasionally. Then, uncover and simmer for another 30 mins\n2. While the tomato sauce is cooking, prepare the bechamel sauce. .\n3. Heat a frying pan to very hot and lightly brush some eggplant slices with a bit of oil and grill for 2 mins on each side. Then grill the zucchini slices\n4.Heat the remaining oil in a frying pan and gently fry the potato slices for around 5 mins on each side, until golden. Drain on paper towel\n5. Arrange a layer of potatoes in the base of a large baking dish. Add a layer of grilled eggplant and sprinkle with breadcrumbs and cheese. Add a layer of grilled zucchini and cover with tomato sauce. Repeat until baking dish is full\n6.Cover the moussaka with the bechamel sauce and sprinkle with the remaining breadcrumbs and cheese. Bake in the oven for around 45 mins or until golden brown.", 
      "Tags": ["schlöpp", "schlopp", "vegan", "glutenfree", "winter", "dairyfree", "moussaka"]

    },
    {
      "name": "Bechamel sauce",
      "Info": "A white sauce for Vegetable Moussaka",
      "Ingredients": "**Ingredients:**\n-2 cups vegan milk\n-50g margarine\n-2 tablespoons of potato flour\n-Salt",
      "Method": "**Methods:**\n1. Pour the milk into a small saucepan and heat gently.\n2. Meanwhile, melt the butter in another saucepan over medium heat. Whisk the flour into the butter and cook, continuing to whisk for a few mins. Add salt and remove from heat, then slowly add milk.\n 3. Return the saucepan to the heat and cook until thick, whisking constantly. Remove from heat",
      "Tags": ["bechamel", "bechamelsauce", "vegan"]
    },
    {
      "name": "Jollof Rice",
      "Info": "A west African rice dish",
      "Ingredients":"**Ingredients:**\n-1 chicken thigh\n-1/2 tablespoon oil\n-1/4 onion, sliced\n-1/2 red chilli, finely sliced\n-200g canned diced tomatoes\n-1/2 tablespoon tomato paste\n-1 cup liquid chicken stock\n-1/2 cup long grain rice",
      "Method": "**Method:**\n1. Cut chicken into cubes\n2. Heat oil in large saucepan and cook chicken until browned\n3. Add onion and chilli, cook for 1-2 minutes\n4. Add rice with stock, tomato paste, and canned tomatoes, cover and cook for 30 minutes, until rice has absorbed liquid and is tender (more stock may be needed)\n5. Serve and garnish if pleased.",
      "Tags": ["schlöpp", "schlopp", "rice", "glutenfree", "dairyfree", "chicken", "level2", "jollofrice"]
    },
    {
      "name": "Chicken Risotto",
      "Info": "An italian rice dish",
      "Ingredients":"**Ingredients:**\n-60g chicken breast, diced\n-1/2 tablespoon olive oil\n-1/4 brown onion, finely diced\n-1/4 cup Arborio rice\n-1 cup chicken stock\n-1/4 cup sliced mushrooms\n-30g of spinach leaves\n-1/2 cup of cheese\n-salt and pepper",
      "Method": "**Method:**\n1. Heat oil, and lightly fry chicken until just white (do not brown). Then remove from pan and set aside.\n2. Add onions to pan and cook for a few minutes, add rice and allow it to be coated by the onion and oil for a few minutes\n3.Add boiling stock to the rice,1/4 cup at a time, bringing back to a boil each time before adding more\n4. Cook rice until just tender, add all other ingredients and stir\n5. Serve whilst hot",
      "Tags": ["schlöpp", "schlopp", "rice", "chicken", "glutenfree", "level2"]
    },
    {
      "name": "Creamed Rice",
      "Info": "A European rice dessert",
      "Ingredients":"**Ingredients:**\n-1/3 cup short grain rice\n-1/2 cup water\n-1+1/4 cup milk\n1 egg, lightly beaten\n-2 tablespoons white sugar\n-1/2 teaspoon vanilla essence\n-1/2 cup berry compote",
      "Method": "**Method:**\n1. Preheat oven to 180C (350F) Place rice and water in a saucepan, bring to boil, simmer until water is just absorbed, stirring continuously.\n3.Add 1/2 the milk, cook further 5-10 minutes, continue stirring until the mixture thickens\n4. Add remain milk, egg, sugar and vanilla essence\n5. Place in an ovenproof dish and bake until rice is set\n5.Serve warn with berry compote!",
      "Tags": ["rice", "dessert", "sweet", "fruit", "ricepudding", "creamedrice", "level2"]
    },
    {
      "name": "Gnocchi",
      "Info": "Pasta made with potatoes.\nFor a tomato sauce recipe, use `!b recipe gnocchisauce`",
      "Ingredients":"**Ingredients:**\n-500 g potatoes\n-1 egg yolk \n-75 g rice flour (additional rice flour to coat)",
      "Method": "**Method:**\n1. Fill a pot with cold water and potatoes, bring to the boil, cook for approximately 20 minutes or until soft\n2. Once the potatoes have softened, remove the skin and leave to cool slightly\n3. When cool, use a potato ricer to rice the potatoes into a large bowl. Season your potatoes with salt and pepper.\n4. Add an egg yolk on top of the potato, lastly add the flour to the bowl\n5. Mix with your hands. DO NOT OVER MIX!! Use a small amount of rice flour to coat the gnocchi.\n6. Slice the ball of gnocchi into smaller pieces and roll into a log shape and slice into 2-3 cm pieces and roll with a fork\n7. Cook your gnocchi in boiling water which is lightly salted.\n*NOTE:* Cook the gnocchi in batches. Once the gnocchi rise to the top of the boiling water it is ready to take out. ",
      "Tags": ["pasta", "gnocchi", "potato", "dinner", "italian", "glutenfree", "level3", "vegan"]
    },
    {
      "name": "Tomato sauce",
      "Info": "A tomato sauce for pasta",
      "Ingredients": "**Ingredients:**\n-¾ cup crushed tomatoes\n-1 TB olive oil\n-1/4 tsp dried basil or oregano\n-1 clove garlic, finely chopped\n-Salt and pepper",
      "Method": "**Methods:**\n1. Heat oil in a pan, add herbs and toss for a few seconds.\n2. Add crushed tomatoes and simmer for a few minutes\n3. Adjust seasoning to your taste and serve with pasta.",
      "Tags": ["gnocchisauce", "pastasauce", "tomatosauce", "sauce", "level3"]
    },
    {
      "name": "Gozleme",
      "Info": "Savory Turkish stuffed flatbread",
      "Ingredients":"**Ingredients for dough:**\n-2 cups plain flour\n-200-250mL water\n-1 tsp salt\n**Ingredients for possible fillings:**\n-onion, mushroom, capsicum, mozzarella\n-onion, mince, tomato, pepper, parsley\n-onion, grated cooked potato, parsley, pepper\n-feta cheese, spinach",
      "Method": "**Method:**\n1. Place the flour and salt in a large bowl. Gradually add the water (not all will be needed!)\n2. Knead until dough is not sticky. Rest and then divide into 4 balls and roll out as thin as possible.\n3. Prepare the vegetables (includes cooking mince, potato, onions if using) and mix all filling ingredients together in a bowl.\n4. Season with salt and pepper. Place filling in the centre and fold.\n5. Place 1 tsp of oil in the pan. Fry each side of the gozleme until browned slightly.",
      "Tags": ["gozleme", "gözleme", "bread", "level2", "vegetarian", "schlöpp", "schlopp", "savoury", "liz"]
    },
    {
      "name": "Carrot cake",
      "Info": "Cake! Carrots! Woah!",
      "Ingredients": "**Ingredients for cake:**\n-1 cup self-raising flour (plus extra for dusting)\n-1 large egg\n-1/6 cup brown sugar\n-35mL olive oil\n-1/8 teaspoon ground ginger\n-1/8 teaspoon ground cinnamon\n-1/2 apple\n-3/4 carrot\n-1/4 orange, zest and juice\n**Ingredients for icing:**\n-75g unsalted butter, soltened\n-1/2 cup icing sugar\n-1/2 orange, zest\n-1/2 cup cream cheese",
      "Method": "**Methods:**\n1, Prehea the oven to 190C (370F). Grease a cake tin with oil spray\n2. Lightly beat the eggs in a large bowl, add sugar and oil, the mix to combine. Sieve in the flour and spices, then fold through. Peel and grate apple and carrot, then stir into the mixture along with juice and zest of orange/n3.Pour the mixture into prepared cake tin, then place into ocean for 30-35 minutes. Test with a skewer that comes out clean when inserted. Leave cake to cool before removing it from tin\n4. Meanwhile, make the icing. Beat the butter, icing sugar and orange zest until pale and smooth, then stir in the cream cheese until just combined\n5. Once cake is cooled, decorate with icing and enjoy",
      "Tags": ["cake", "carrotcake", "dessert", "sweet", "level3", "vegan", "vegetarian"]
    },    
    {
      "name": "Eggplant Parmigiana Lasagne",
      "Info": "A twist on the traditional lasagne, serves 6-8",
      "Ingredients": "**Ingredients:**\n-2-3 large eggplants (aubergines)\n-salt\n-150g plain flour\n-3 eggs, whisked with 125mL water\n-olive oil, for frying\n-250g italian breadcrumbs\n-1L bolognese sauce\n-750g dried lasagne sheets\n-230g cheddar cheese, grated\n-125g mozzarella cheese, grated\n-450g ricotta\n-100g parmeasan cheese, grated",
      "Method": "**Method:**\n1. Cut the eggplants into 1.5cm thick rounds. Lay in a shallow tray and sprinkle both sides with salt. Set aside for 30 minutes. Wipe salt and any liquid off with paper towel\n2. Dredge the eggplant in flour, then the egg wash, then the breadcrumbs making sure the slices are well coated. Heat enough olive oil in a shallow frypan to reach 1cm up the sides on a medium heat. Fry the slices gently on each side until golden and tender. Drain on paper towels\n3. Preheat oven to 180C (350F). Spoon a little bolognese sauce into the base of a large baking dish (you may need more or less ingredients depending on size) and spread to lightly cover the bottom\n4. Lay the lasagne sheets to cover the base in a single layer, breaking the sheets to fit as needed. Top the sheets with a few ladlefuls of sauce. Scatter with a handful of cheddar cheese and a sprinkle of parmeasan\n5. Repeat, this time adding a layer of eggplant slices, mozzarella and a few dollops of ricotta. Keep layering with pasta sheets, sauce, cheese and eggplant as you please until the dish is full. With the last layer of sauce, cover liberally with cheese and a few dollops of ricotta.\n6. If your sauce was cold, pour water to fill half the baking dish around the sides to ensure the pasta has moisture to cook through. Then, cover with baking paper, then top with foil to seal and bake for 45 minutes, then uncover and cook for 15 minutes or until golden. Allow to sit for a minimum 15-20 minutes to settle before serving. Then enjoy.",
      "Tags": ["lasagne", "eggplantparmigianalasagne", "eggplant", "aubergine", "dinner", "winter", "kae"]
    },
    {
      "name": "Chocolate Roulade",
      "Info": "Similar to a swiss roll!",
      "Ingredients": "**Ingredients for roulade:**\n-1/2 cup plain flour\n-2 tablespoons cocoa powder\n-4 large eggs\n-1/3 cup caster sugar\n-50g butter, melted\n**Ingredients for filling:**\n-Jam of choosing\n-1/2 cup of cream, whipped\n-1/2 cup of cherries\n-Icing sugar (to decorate)",
      "Method": "**Method:**\n1. Preheat oven to 180C (350F). Brush or spray swiss roll cake pan with oil and line base with baking paper\n2. Sift flour and cocoa powder together\n3. Using electric beaters, beat the eggs and sugar together until the mixture forms a figure 8. Fold in the sifted flour and cocoa powder\n4. Gently but quickly incorporate the melted butter. Pour the mixture into the prepared tin and spread to the edges and then bake for 8 mintues or until firm to the touch\n5. Turn the warm chocolate sponge onto a clean tea towel and peel of the paper and roll up the sponge by lifting the tea towl. Set aside to cool\n6. Once cooled, unroll the chocolate sponge and spread with a thin layer of jam. Spread with the whipped cream and arrange the cherries over the cream\n7. Carefull roll up the sponge so that iit is firm but not too tight and sprinkle with icing sugar to serve!",
      "Tags": ["cholateroulade", "chocolate", "dessert", "sweet", "level3", "vegetarian"]
    },
    {
      "name": "",
      "Info": "",
      "Ingredients": "",
      "Method": "",
      "Tags": []
    },
    {
      "name": "",
      "Info": "",
      "Ingredients": "",
      "Method": "",
      "Tags": []
    }]
